# Pandas_Practice

In [1]:
import numpy as np
import pandas as pd

In [3]:
dictionery = {
    'Name' : ['Mabtoor', 'Zaka', 'Zeeshan', 'Atif', 'Nida', 'Taqveem', 'Mrs Choudary', 'Ijaz_Wani'],
    'City' : ['Faisalabad', 'Bahawalpur', 'kuala lumpur', 'Sydney', 'Dubai', 'Jehlum', 'Lahore', 'Austria'],
    'Marks' : [21,41,63,73,46,97,54,79],
    'Remarks' : ['Good','Nice','Effortless', 'Brilliant', 'Maximum', 'Gracefull', 'Smartless', 'Energetic']
}

In [4]:
dictionery

{'Name': ['Mabtoor',
  'Zaka',
  'Zeeshan',
  'Atif',
  'Nida',
  'Taqveem',
  'Mrs Choudary',
  'Ijaz_Wani'],
 'City': ['Faisalabad',
  'Bahawalpur',
  'kuala lumpur',
  'Sydney',
  'Dubai',
  'Jehlum',
  'Lahore',
  'Austria'],
 'Marks': [21, 41, 63, 73, 46, 97, 54, 79],
 'Remarks': ['Good',
  'Nice',
  'Effortless',
  'Brilliant',
  'Maximum',
  'Gracefull',
  'Smartless',
  'Energetic']}

In [5]:
df= pd.DataFrame(dictionery)

In [6]:
df

           Name          City  Marks     Remarks
0       Mabtoor    Faisalabad     21        Good
1          Zaka    Bahawalpur     41        Nice
2       Zeeshan  kuala lumpur     63  Effortless
3          Atif        Sydney     73   Brilliant
4          Nida         Dubai     46     Maximum
5       Taqveem        Jehlum     97   Gracefull
6  Mrs Choudary        Lahore     54   Smartless
7     Ijaz_Wani       Austria     79   Energetic

In [7]:
df.to_csv('Information.csv')

In [8]:
df.to_csv('Information_Without_Indices.csv')

In [9]:
df

           Name          City  Marks     Remarks
0       Mabtoor    Faisalabad     21        Good
1          Zaka    Bahawalpur     41        Nice
2       Zeeshan  kuala lumpur     63  Effortless
3          Atif        Sydney     73   Brilliant
4          Nida         Dubai     46     Maximum
5       Taqveem        Jehlum     97   Gracefull
6  Mrs Choudary        Lahore     54   Smartless
7     Ijaz_Wani       Austria     79   Energetic

In [10]:
df.head()

      Name          City  Marks     Remarks
0  Mabtoor    Faisalabad     21        Good
1     Zaka    Bahawalpur     41        Nice
2  Zeeshan  kuala lumpur     63  Effortless
3     Atif        Sydney     73   Brilliant
4     Nida         Dubai     46     Maximum

In [11]:
df.tail()

           Name     City  Marks    Remarks
3          Atif   Sydney     73  Brilliant
4          Nida    Dubai     46    Maximum
5       Taqveem   Jehlum     97  Gracefull
6  Mrs Choudary   Lahore     54  Smartless
7     Ijaz_Wani  Austria     79  Energetic

In [12]:
df.head(2)

      Name        City  Marks Remarks
0  Mabtoor  Faisalabad     21    Good
1     Zaka  Bahawalpur     41    Nice

In [13]:
df.tail(2)

           Name     City  Marks    Remarks
6  Mrs Choudary   Lahore     54  Smartless
7     Ijaz_Wani  Austria     79  Energetic

In [15]:
df.index

RangeIndex(start=0, stop=8, step=1)

In [16]:
df.columns

Index(['Name', 'City', 'Marks', 'Remarks'], dtype='object')

In [20]:
friends = pd.read_csv('Personal_Friends.csv')

In [21]:
friends

   Unnamed: 0  TrainNo  SeatNo PassangersName Destinations
0           0       43      54        Zeeshan     Malaysia
1           1       65      63           Atif       Sydney
2           2       74      54           Zaka   Bahawalpur
3           3       85      63           Umar   Faisalabad
4           4       24      45        taqveem       Jehlum
5           5       64      46   Mrs.Choudary       Lahore
6           6       73      46    Umer Yaqoob   Faisalabad

In [22]:
friends['TrainNo']

0    43
1    65
2    74
3    85
4    24
5    64
6    73
Name: TrainNo, dtype: int64

In [23]:
friends.index

RangeIndex(start=0, stop=7, step=1)

In [24]:
friends.columns

Index(['Unnamed: 0', 'TrainNo', 'SeatNo', 'PassangersName', 'Destinations'], dtype='object')

In [25]:
friends.head(2)

   Unnamed: 0  TrainNo  SeatNo PassangersName Destinations
0           0       43      54        Zeeshan     Malaysia
1           1       65      63           Atif       Sydney

In [26]:
friends.tail(2)

   Unnamed: 0  TrainNo  SeatNo PassangersName Destinations
5           5       64      46   Mrs.Choudary       Lahore
6           6       73      46    Umer Yaqoob   Faisalabad

In [27]:
friends['SeatNo'][5] = 52

<ipython-input-27-944bec2fbbac>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  friends['SeatNo'][5] = 52

In [28]:
friends

   Unnamed: 0  TrainNo  SeatNo PassangersName Destinations
0           0       43      54        Zeeshan     Malaysia
1           1       65      63           Atif       Sydney
2           2       74      54           Zaka   Bahawalpur
3           3       85      63           Umar   Faisalabad
4           4       24      45        taqveem       Jehlum
5           5       64      52   Mrs.Choudary       Lahore
6           6       73      46    Umer Yaqoob   Faisalabad

In [29]:
ser = pd.Series(np.random.randint(2,4))

In [30]:
ser

0    2
dtype: int64

In [31]:
type(ser)

pandas.core.series.Series

In [34]:
newdf = pd.DataFrame(np.random.rand(443,4), index=np.arange(443))

In [35]:
newdf

            0         1         2         3
0    0.254917  0.787095  0.239088  0.284318
1    0.245963  0.972372  0.933101  0.914154
2    0.962912  0.445243  0.936070  0.917919
3    0.912417  0.972347  0.861084  0.018245
4    0.711203  0.549370  0.814258  0.827685
..        ...       ...       ...       ...
438  0.920939  0.416649  0.847789  0.385309
439  0.407680  0.336233  0.102381  0.232752
440  0.641310  0.869629  0.448268  0.019803
441  0.876281  0.499316  0.328070  0.786009
442  0.916937  0.265344  0.475756  0.198228

[443 rows x 4 columns]

In [36]:
newdf.shape

(443, 4)

In [37]:
newdf.head()

          0         1         2         3
0  0.254917  0.787095  0.239088  0.284318
1  0.245963  0.972372  0.933101  0.914154
2  0.962912  0.445243  0.936070  0.917919
3  0.912417  0.972347  0.861084  0.018245
4  0.711203  0.549370  0.814258  0.827685

In [38]:
newdf.tail()

            0         1         2         3
438  0.920939  0.416649  0.847789  0.385309
439  0.407680  0.336233  0.102381  0.232752
440  0.641310  0.869629  0.448268  0.019803
441  0.876281  0.499316  0.328070  0.786009
442  0.916937  0.265344  0.475756  0.198228

In [39]:
newdf.ndim

2

In [40]:
newdf.to_numpy()

array([[0.25491685, 0.78709467, 0.23908806, 0.28431779],
       [0.24596285, 0.97237208, 0.93310122, 0.9141537 ],
       [0.96291168, 0.44524332, 0.93606963, 0.91791899],
       ...,
       [0.64130979, 0.86962863, 0.44826756, 0.01980309],
       [0.87628135, 0.4993161 , 0.32806962, 0.78600921],
       [0.91693659, 0.26534428, 0.47575603, 0.19822821]])

In [41]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,433,434,435,436,437,438,439,440,441,442
0,0.254917,0.245963,0.962912,0.912417,0.711203,0.133041,0.313296,0.302669,0.116428,0.275729,...,0.594587,0.999289,0.586310,0.998148,0.816625,0.920939,0.407680,0.641310,0.876281,0.916937
1,0.787095,0.972372,0.445243,0.972347,0.549370,0.351103,0.593192,0.656503,0.316577,0.726454,...,0.556782,0.578053,0.166735,0.079306,0.174851,0.416649,0.336233,0.869629,0.499316,0.265344
2,0.239088,0.933101,0.936070,0.861084,0.814258,0.530475,0.492433,0.259646,0.340226,0.675419,...,0.218259,0.237840,0.874806,0.467459,0.308480,0.847789,0.102381,0.448268,0.328070,0.475756
3,0.284318,0.914154,0.917919,0.018245,0.827685,0.093811,0.553299,0.430562,0.129765,0.339155,...,0.670419,0.065548,0.922764,0.485181,0.537215,0.385309,0.232752,0.019803,0.786009,0.198228